app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title ILIKE '%' OR title ILIKE '% %') ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (title ILIKE '%' OR title ILIKE '% %')
---
  def index
    authorize Post
    @posts = Post.order(created_at: :desc).includes(:author).
      where('title ILIKE ? OR title ILIKE ?', "#{params[:query]}%", "% #{params[:query]}%").page params[:page]

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Name"], ["body", "Surname\r\nTell me about you"], ["created_at", "2021-05-23 17:52:40.887340"], ["updated_at", "2021-05-23 17:52:40.887340"], ["author_id", 1]]
---
  def create
    authorize Post
    @post = Post.new(post_params)
    @post.author = current_user

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "jhjhhfghfhfghg"], ["updated_at", "2021-05-22 18:57:11.426628"], ["id", 3]]
---
  def update
    authorize @post
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    authorize @post
    @post.destroy